; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-7-249)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s2)
	(at driver4 s0)
	(at driver5 s2)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s0)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s1)
	(at package2 s0)
	(at package3 s2)
	(at package4 s1)
	(at package5 s2)
	(at package6 s2)
	(at package7 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 23)
	(= (time-to-walk p0-1 s0) 23)
	(= (time-to-walk s1 p0-1) 10)
	(= (time-to-walk p0-1 s1) 10)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 20)
	(= (time-to-walk p0-2 s0) 20)
	(= (time-to-walk s2 p0-2) 4)
	(= (time-to-walk p0-2 s2) 4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 13)
	(= (time-to-walk p1-2 s1) 13)
	(= (time-to-walk s2 p1-2) 18)
	(= (time-to-walk p1-2 s2) 18)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 18)
	(= (time-to-drive s0 s1) 18)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 13)
	(= (time-to-drive s2 s1) 13)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 7)
	(= (time-to-drive s2 s0) 7)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver4 s0)
	(at driver5 s1)
	(at truck3 s0)
	(at truck4 s0)
	(at truck5 s1)
	(at package1 s1)
	(at package2 s0)
	(at package3 s1)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s1)
	))

(:metric minimize (+ (* 2 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver5 truck2 s2)
   deleted: (at driver5 s2) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 6 of 12
2. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 6 of 12
3. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 12
4. (load-truck package4 truck4 s1)
   deleted: (at package4 s1)
   added: (in package4 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 6 of 12
5. (drive-truck truck4 s1 s0 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (fuel-used) from 0 to 198
   goals met: 7 of 12
6. (board-truck driver4 truck5 s0)
   deleted: (at driver4 s0) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 6 of 12
7. (drive-truck truck2 s2 s1 driver5)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 198 to 341
   goals met: 6 of 12
8. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 7 of 12
9. (drive-truck truck5 s0 s1 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (fuel-used) from 341 to 521
   goals met: 8 of 12
10. (drive-truck truck5 s1 s2 driver4)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (fuel-used) from 521 to 651
   goals met: 7 of 12
11. (load-truck package6 truck5 s2)
   deleted: (at package6 s2)
   added: (in package6 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 7 of 12
12. (drive-truck truck5 s2 s0 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 651 to 728
   goals met: 7 of 12
13. (disembark-truck driver4 truck5 s0)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 8 of 12
14. (board-truck driver4 truck3 s0)
   deleted: (at driver4 s0) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 7 of 12
15. (unload-truck package6 truck5 s0)
   deleted: (in package6 truck5)
   added: (at package6 s0)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 7 of 12
16. (disembark-truck driver5 truck2 s1)
   deleted: (driving driver5 truck2)
   added: (at driver5 s1) (empty truck2)
   goals met: 8 of 12
17. (unload-truck package4 truck4 s0)
   deleted: (in package4 truck4)
   added: (at package4 s0)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 9 of 12
18. (drive-truck truck4 s0 s1 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (fuel-used) from 728 to 908
   goals met: 8 of 12
19. (load-truck package6 truck3 s0)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 8 of 12
20. (drive-truck truck4 s1 s0 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (fuel-used) from 908 to 1088
   goals met: 9 of 12
21. (drive-truck truck3 s0 s1 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 1088 to 1286
   goals met: 8 of 12
22. (unload-truck package6 truck3 s1)
   deleted: (in package6 truck3)
   added: (at package6 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 12
23. (disembark-truck driver1 truck4 s0)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 9 of 12
24. (drive-truck truck3 s1 s0 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 1286 to 1466
   goals met: 10 of 12
25. (disembark-truck driver4 truck3 s0)
   deleted: (driving driver4 truck3)
   added: (at driver4 s0) (empty truck3)
   goals met: 11 of 12
26. (board-truck driver1 truck5 s0)
   deleted: (at driver1 s0) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 11 of 12
27. (drive-truck truck5 s0 s1 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (fuel-used) from 1466 to 1646
   goals met: 12 of 12
